README.org
#+AUTHOR: avkoval (ok)
#+TITLE: Planning Poker
#+SETUPFILE: https://raw.githubusercontent.com/fniessen/org-html-themes/master/org/theme-readtheorg.setup
#+OPTIONS: num:nil toc:t ^:nil

* What is this

I am playing with technology and trying new things. Because JIRA does not provide
such functionality out of the box, I would like to develop SPA to play it with my
team. I am aware about tons of /similar/ products existing in this area (all are paid!), 
never seen any of them, and actually the work I do here is mostly for _my personal skills 
development_.

* Project structure

#+begin_example
Directory tree
==============
[-] PlanningPoker
 |--[+] __pycache__
 |--[-] backend                    <--- backed code
 |   |--[+] __pycache__
 |   |----- __init__.py
 |   |----- config.py
 |   `----- main.py                <---------------- main.py
 |--[+] planningpoker
 |--[-] pp-front                   <-- UIx project, created with:
 |   |--[+] dev                        npx create-uix-app@latest pp-front --re-frame`
 |   |--[+] node_modules
 |   |--[+] public
 |   |--[-] src
 |   |   `--[-] app
 |   |       |----- core.cljs      <--- function of FrontEnd
 |   |       |----- core.css
 |   |       |----- db.cljs
 |   |       |----- fx.cljs
 |   |       |----- handlers.cljs
 |   |       |----- hooks.cljs
 |   |       `----- subs.cljs
 |   |----- LICENSE.md
 |   |----- README.md
 |   |----- deps.edn
 |   |----- package.json
 |   |----- shadow-cljs.edn
 |   `----- yarn.lock
 |--[+] static
 |--[-] templates
 |   `----- index.html
 |--[+] tests
 |----- README.org                 <----- mode Source of this README.html
 |----- __init__.py
 |----- bb.edn                     <----- for commands
 |----- poetry.lock
 `----- pyproject.toml

#+end_example

* Architecture & UI ideas [6/6]

 - [X] FastAPI on Backend
 - [X] UIX^2 on Frontend
 - [X] .env configuration
 - [X] Local memory caching for retrieved Jira data
 - [X] Websocket for group actions
 - [X] Logging screen on frontend (from websocket log)
   - [X] "Vote accepted from ..."
   - [X] "User ... logged in"

* Install
  Backend:
  #+begin_src tmux
  poetry install
  #+end_src
* Setup

  Copy & edit contents of .env file: setup variables

#+begin_example
cp .env-example .env
#+end_example
  
  To do this you will need to create Google Project and obtain Oauth authorization keys.

** Available settings

| Variable name         | Documentation                                                                                               |
|-----------------------+-------------------------------------------------------------------------------------------------------------|
| GOOGLE_CLIENT_ID      | Google Oauth credentials                                                                                    |
| GOOGLE_CLIENT_SECRET  |                                                                                                             |
| SECRET_KEY            | Secret key, must be specified                                                                               |
| ALLOWED_EMAIL_DOMAINS | Restrict domains list (for example list here only organization domains). If empty - all domains are allowed |

* Run

#+begin_example
poetry run fastapi dev backend/main.py
#+end_example

(if you have babashka installed):
#+begin_example
bb run fastapi
#+end_example

* WORKING Work Log: Planning poker for Fieldhub
  SCHEDULED: <2024-08-17 Sat>
  :LOGBOOK:
  CLOCK: [2024-09-09 Mon 07:08]--[2024-09-09 Mon 07:45] =>  0:37
  CLOCK: [2024-08-17 Sat 09:52]--[2024-08-17 Sat 10:04] =>  0:12
  CLOCK: [2024-08-17 Sat 08:14]--[2024-08-17 Sat 09:00] =>  0:46
  - State "WORKING"    from "IDEA"       [2024-08-17 Sat 08:05]
  - State "IDEA"       from "TODO"       [2024-08-17 Sat 08:05]
  - State "TODO"       from              [2024-08-17 Sat 07:55]
  :END:

** DONE Technical design & architecture
   CLOSED: [2024-09-22 Sun 13:15]
   :LOGBOOK:
   - State "DONE"       from              [2024-09-22 Sun 13:15]
   :END:
*** DONE View practically, Kit, Uix & bootstrap the project
    CLOSED: [2024-08-17 Sat 20:05]
    :LOGBOOK:
    - State "DONE"       from "WORKING"    [2024-08-17 Sat 20:05]
    CLOCK: [2024-08-17 Sat 13:25]--[2024-08-17 Sat 17:07] =>  3:42
    CLOCK: [2024-08-17 Sat 11:20]--[2024-08-17 Sat 11:38] =>  0:18
    - State "WORKING"    from "DONE"       [2024-08-17 Sat 11:20]
    - State "DONE"       from "TODO"       [2024-08-17 Sat 11:15]
    - State "TODO"       from              [2024-08-17 Sat 07:55]
    :END:

 - [X] Decided to use FastCGI instead of Kit in this round ([2024-08-17 Sat 11:20]). Reasons:
   - I already know how to use Jira integtration with Python
   - I want to gain some FastAPI experience
 - [X] How to add ReFrame? 11:29.44 (00:08) Found, explained in: https://github.com/pitch-io/uix-starter
   #+begin_example
   npx create-uix-app@latest my-app --re-frame # adds re-frame setup
   #+end_example
 - [X] View (again) [[https://www.youtube.com/watch?v=4vgrLHsD0-I&t=3s][intro video from Roman Liutikov]]
 - [X] Re-try modern React tutorial
 - [X] Start learning Udemy React course, take some first lessons

