static/docs/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-22 Sun 14:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Planning Poker</title>
<meta name="author" content="avkoval (ok)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Planning Poker</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9a13bc1">What is this</a></li>
<li><a href="#orge968852">Project structure</a></li>
<li><a href="#org46d1c70">Architecture &amp; UI ideas <code>[6/6]</code></a></li>
<li><a href="#org3fa80bf">Install</a></li>
<li><a href="#org7f3bed2">Setup</a>
<ul>
<li><a href="#orgc060bfa">Available settings</a></li>
</ul>
</li>
<li><a href="#org58abe44">Run</a></li>
<li><a href="#org57c6824"><span class="todo WORKING">WORKING</span> Work Log: Planning poker for Fieldhub</a>
<ul>
<li><a href="#org7b8d852"><span class="done DONE">DONE</span> Technical design &amp; architecture</a>
<ul>
<li><a href="#org5bd8b0a"><span class="done DONE">DONE</span> View practically, Kit, Uix &amp; bootstrap the project</a></li>
<li><a href="#org6581361"><span class="done DONE">DONE</span> use FastAPI! use Google auth &amp; ready Jira integration I have!</a></li>
<li><a href="#org05baac1"><span class="done DONE">DONE</span> Use websocket for fast communication!</a></li>
</ul>
</li>
<li><a href="#orgf0d03a7"><span class="done REJECTED">REJECTED</span> UI Plan on functional implementation <code>[0/6]</code></a></li>
<li><a href="#orga7672fc"><span class="done DONE">DONE</span> Bootstrap: FastAPI + UIx^2 in one folder &amp; dev/prod start/deploy/+sentry/+logging</a></li>
<li><a href="#org597f9db"><span class="done DONE">DONE</span> Google auth &amp; JWT token (or session cookie)</a></li>
<li><a href="#org2f78966"><span class="done DONE">DONE</span> add running via bb.edn</a></li>
<li><a href="#org767ab4d"><span class="done DONE">DONE</span> fix burger menu for mobile</a></li>
<li><a href="#orgacebabe"><span class="done DONE">DONE</span> use iframe for docs part</a></li>
<li><a href="#org2a65066"><span class="todo TODO">TODO</span> Search for ticket (Estimate ticket screen) <code>[14/16]</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="verb">verb</span></span></a></li>
<li><a href="#org2262466"><span class="done DONE">DONE</span> add jql: search support</a></li>
<li><a href="#org94d83cc"><span class="done DONE">DONE</span> fix design=placement for estimate / results boxes</a></li>
<li><a href="#org0b2c3ca"><span class="done DONE">DONE</span> logging</a></li>
<li><a href="#org42ffee8"><span class="done DONE">DONE</span> Voting screen <code>[15/15]</code> <code>[100%]</code></a></li>
<li><a href="#org2afde18"><span class="done DONE">DONE</span> check logged in state (when in <code>/app</code>) and other statuses (because currenly it allows to see <code>/app/</code> <code>[1/2]</code></a></li>
<li><a href="#org55cbf3e"><span class="done DONE">DONE</span> Websocket coordination <code>[9/10]</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9a13bc1" class="outline-2">
<h2 id="org9a13bc1">What is this</h2>
<div class="outline-text-2" id="text-org9a13bc1">
<p>
I am playing with technology and trying new things. Because JIRA does not provide
such functionality out of the box, I would like to develop SPA to play it with my
team. I am aware about tons of <i>similar</i> products existing in this area (all are paid!), 
never seen any of them, and actually the work I do here is mostly for <span class="underline">my personal skills 
development</span>.
</p>
</div>
</div>
<div id="outline-container-orge968852" class="outline-2">
<h2 id="orge968852">Project structure</h2>
<div class="outline-text-2" id="text-orge968852">
<pre class="example" id="org99a29a1">
Directory tree
==============
[-] PlanningPoker
 |--[+] __pycache__
 |--[-] backend                    &lt;--- backed code
 |   |--[+] __pycache__
 |   |----- __init__.py
 |   |----- config.py
 |   `----- main.py                &lt;---------------- main.py
 |--[+] planningpoker
 |--[-] pp-front                   &lt;-- UIx project, created with:
 |   |--[+] dev                        npx create-uix-app@latest pp-front --re-frame`
 |   |--[+] node_modules
 |   |--[+] public
 |   |--[-] src
 |   |   `--[-] app
 |   |       |----- core.cljs      &lt;--- function of FrontEnd
 |   |       |----- core.css
 |   |       |----- db.cljs
 |   |       |----- fx.cljs
 |   |       |----- handlers.cljs
 |   |       |----- hooks.cljs
 |   |       `----- subs.cljs
 |   |----- LICENSE.md
 |   |----- README.md
 |   |----- deps.edn
 |   |----- package.json
 |   |----- shadow-cljs.edn
 |   `----- yarn.lock
 |--[+] static
 |--[-] templates
 |   `----- index.html
 |--[+] tests
 |----- README.org                 &lt;----- mode Source of this README.html
 |----- __init__.py
 |----- bb.edn                     &lt;----- for commands
 |----- poetry.lock
 `----- pyproject.toml

</pre>
</div>
</div>
<div id="outline-container-org46d1c70" class="outline-2">
<h2 id="org46d1c70">Architecture &amp; UI ideas <code>[6/6]</code></h2>
<div class="outline-text-2" id="text-org46d1c70">
<ul class="org-ul">
<li class="on"><code>[X]</code> FastAPI on Backend</li>
<li class="on"><code>[X]</code> UIX^2 on Frontend</li>
<li class="on"><code>[X]</code> .env configuration</li>
<li class="on"><code>[X]</code> Local memory caching for retrieved Jira data</li>
<li class="on"><code>[X]</code> Websocket for group actions</li>
<li class="on"><code>[X]</code> Logging screen on frontend (from websocket log)
<ul class="org-ul">
<li class="on"><code>[X]</code> "Vote accepted from &#x2026;"</li>
<li class="on"><code>[X]</code> "User &#x2026; logged in"</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3fa80bf" class="outline-2">
<h2 id="org3fa80bf">Install</h2>
<div class="outline-text-2" id="text-org3fa80bf">
<p>
Backend:
</p>
<div class="org-src-container">
<pre class="src src-tmux">poetry install
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f3bed2" class="outline-2">
<h2 id="org7f3bed2">Setup</h2>
<div class="outline-text-2" id="text-org7f3bed2">
<p>
Copy &amp; edit contents of .env file: setup variables
</p>

<pre class="example" id="org87f4a88">
cp .env-example .env
</pre>

<p>
To do this you will need to create Google Project and obtain Oauth authorization keys.
</p>
</div>
<div id="outline-container-orgc060bfa" class="outline-3">
<h3 id="orgc060bfa">Available settings</h3>
<div class="outline-text-3" id="text-orgc060bfa">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable name</th>
<th scope="col" class="org-left">Documentation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GOOGLE_CLIENT_ID</td>
<td class="org-left">Google Oauth credentials</td>
</tr>

<tr>
<td class="org-left">GOOGLE_CLIENT_SECRET</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SECRET_KEY</td>
<td class="org-left">Secret key, must be specified</td>
</tr>

<tr>
<td class="org-left">ALLOWED_EMAIL_DOMAINS</td>
<td class="org-left">Restrict domains list (for example list here only organization domains). If empty - all domains are allowed</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org58abe44" class="outline-2">
<h2 id="org58abe44">Run</h2>
<div class="outline-text-2" id="text-org58abe44">
<pre class="example" id="orge2632c2">
poetry run fastapi dev backend/main.py
</pre>

<p>
(if you have babashka installed):
</p>
<pre class="example" id="orgd61cb27">
bb run fastapi
</pre>
</div>
</div>
<div id="outline-container-org57c6824" class="outline-2">
<h2 id="org57c6824"><span class="todo WORKING">WORKING</span> Work Log: Planning poker for Fieldhub</h2>
<div class="outline-text-2" id="text-org57c6824">
</div>
<div id="outline-container-org7b8d852" class="outline-3">
<h3 id="org7b8d852"><span class="done DONE">DONE</span> Technical design &amp; architecture</h3>
<div class="outline-text-3" id="text-org7b8d852">
</div>
<div id="outline-container-org5bd8b0a" class="outline-4">
<h4 id="org5bd8b0a"><span class="done DONE">DONE</span> View practically, Kit, Uix &amp; bootstrap the project</h4>
<div class="outline-text-4" id="text-org5bd8b0a">
<ul class="org-ul">
<li class="on"><code>[X]</code> Decided to use FastCGI instead of Kit in this round (<span class="timestamp-wrapper"><span class="timestamp">[2024-08-17 Sat 11:20]</span></span>). Reasons:
<ul class="org-ul">
<li>I already know how to use Jira integtration with Python</li>
<li>I want to gain some FastAPI experience</li>
</ul></li>
<li class="on"><code>[X]</code> <p>
How to add ReFrame? 11:29.44 (00:08) Found, explained in: <a href="https://github.com/pitch-io/uix-starter">https://github.com/pitch-io/uix-starter</a>
</p>
<pre class="example" id="org3b5790c">
npx create-uix-app@latest my-app --re-frame # adds re-frame setup
</pre></li>
<li class="on"><code>[X]</code> View (again) <a href="https://www.youtube.com/watch?v=4vgrLHsD0-I&amp;t=3s">intro video from Roman Liutikov</a></li>
<li class="on"><code>[X]</code> Re-try modern React tutorial</li>
<li class="on"><code>[X]</code> Start learning Udemy React course, take some first lessons</li>
</ul>
</div>
</div>
