README.org
*** DONE use FastAPI! use Google auth & ready Jira integration I have!
    CLOSED: [2024-08-25 Sun 15:05]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2024-08-25 Sun 15:05]
    CLOCK: [2024-08-18 Sun 20:26]--[2024-08-18 Sun 20:46] =>  0:20
    CLOCK: [2024-08-18 Sun 08:37]--[2024-08-18 Sun 20:26] => 11:49
    - State "TODO"       from              [2024-08-17 Sat 08:10]
    :END:

 - https://google-auth.readthedocs.io/en/master/
 - https://github.com/hanchon-live/tutorial-fastapi-oauth
 - https://blog.hanchon.live/guides/google-login-with-fastapi/ (following)
 - https://docs.authlib.org/en/latest/client/starlette.html (works)

*** DONE Use websocket for fast communication!
    CLOSED: [2024-09-15 Sun 14:55]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2024-09-15 Sun 14:55]
    - State "TODO"       from              [2024-08-17 Sat 08:10]
    :END:

 - FastAPI provides support: 
** REJECTED UI Plan on functional implementation [0/6]
   CLOSED: [2024-09-22 Sun 13:10]
   :LOGBOOK:
   - State "REJECTED"   from              [2024-09-22 Sun 13:10]
   - State "TODO"       from              [2024-08-17 Sat 08:10]
   :END:

 * SPA - one screen on UIx
 * [ ] List logged in users
 * [ ] Set color for facilitator?
   * how to agree who is facilitator? may be anyone can? probably yes, but then warn on top who started it
 * [ ] Countdown timer (configuration for length) starts
 * [ ] List of SPs (configuration)
 * [ ] Strike for users who voted
 * [ ] Reveal cards with some visual effect

** DONE Bootstrap: FastAPI + UIx^2 in one folder & dev/prod start/deploy/+sentry/+logging
   CLOSED: [2024-08-25 Sun 07:05]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2024-08-25 Sun 07:05]
   CLOCK: [2024-08-17 Sat 10:04]--[2024-08-17 Sat 10:24] =>  0:20
   - State "TODO"       from              [2024-08-17 Sat 08:20]
   :END:

- [X] Install fastapi via poetry
- [X] Bootstrap UIX^2 project
- [X] Add/commit to git
- [ ] Publish on github
** DONE Google auth & JWT token (or session cookie)
   CLOSED: [2024-08-25 Sun 07:05]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2024-08-25 Sun 07:05]
   - State "TODO"       from              [2024-08-17 Sat 08:25]
   :END:
** DONE add running via bb.edn
   CLOSED: [2024-08-27 Tue 06:15]
   :LOGBOOK:
   - State "DONE"       from "WORKING"    [2024-08-27 Tue 06:15]
   - State "WORKING"    from "TODO"       [2024-08-25 Sun 15:05]
   - State "TODO"       from              [2024-08-25 Sun 12:10]
   :END:
 - Finish watching [[https://www.youtube.com/watch?v=u5ECoR7KT1Y][Babashka tasks (by Michiel Borkent)]] from /The London Clojurians are happy to present 3 years ago/

** DONE fix burger menu for mobile
   CLOSED: [2024-09-18 Wed 09:10]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2024-09-18 Wed 09:10]
   - State "TODO"       from              [2024-09-17 Tue 15:20]
   :END:

** DONE use iframe for docs part
   CLOSED: [2024-09-17 Tue 20:45]
   :LOGBOOK:
   - State "DONE"       from "WORKING"    [2024-09-17 Tue 20:45]
   - State "WORKING"    from "TODO"       [2024-09-17 Tue 14:30]
   CLOCK: [2024-09-17 Tue 14:32]--[2024-09-17 Tue 14:57] =>  0:25
   - State "TODO"       from              [2024-09-17 Tue 09:35]
   :END:
** TODO Search for ticket (Estimate ticket screen) [14/16]             :verb:
   :LOGBOOK:
   CLOCK: [2024-09-22 Sun 11:26]--[2024-09-22 Sun 11:46] =>  0:20
   CLOCK: [2024-09-22 Sun 10:00]--[2024-09-22 Sun 10:22] =>  0:22
   - State "TODO"       from "DONE"       [2024-09-16 Mon 20:40]
   - State "DONE"       from "WORKING"    [2024-09-15 Sun 15:15]
   CLOCK: [2024-09-15 Sun 15:08]--[2024-09-15 Sun 15:15] =>  0:07
   CLOCK: [2024-09-04 Wed 07:23]--[2024-09-04 Wed 09:23] =>  2:00
   CLOCK: [2024-09-03 Tue 08:52]--[2024-09-03 Tue 09:52] =>  1:00
   CLOCK: [2024-08-31 Sat 14:10]--[2024-08-31 Sat 16:10] =>  2:00
   CLOCK: [2024-08-30 Fri 07:25]--[2024-08-30 Fri 10:56] =>  3:31
   CLOCK: [2024-08-29 Thu 08:05]--[2024-08-29 Thu 10:05] =>  2:00
   CLOCK: [2024-08-28 Wed 21:22]--[2024-08-28 Wed 23:22] =>  2:00
   CLOCK: [2024-08-28 Wed 05:30]--[2024-08-28 Wed 07:00] =>  1:30
   CLOCK: [2024-08-27 Tue 21:30]--[2024-08-27 Tue 21:55] =>  0:25
   - State "WORKING"    from "TODO"       [2024-08-25 Sun 15:05]
   CLOCK: [2024-08-25 Sun 12:00]--[2024-08-25 Sun 13:29] =>  1:29
   - State "TODO"       from              [2024-08-25 Sun 07:05]
   :END:

 - [X] Make a stub function on FastAPI side for now.
 - [X] Select library to make HTTP calls.
   A) Trying https://github.com/lambdaisland/fetch
   B) [X] (this is an alternative to try) https://github.com/r0man/cljs-http?tab=readme-ov-file
      #+begin_src verb
      GET https://api.github.com/users?since=135
      User-agent: emacs
      #+end_src
      * [2024-08-27 Tue 09:25] I am having difficulties to connect async nature of core-async channels (same as promises?)
        to the actual useEffect or anything. Reading...
        * [[https://stackoverflow.com/questions/71174509/proper-async-await-syntax-for-fetching-data-using-useeffect-hook-in-react][async in useEffect]]
        * [[https://pitch-io.github.io/uix/docs/hooks.html][Uix on hooks]]
        * [[https://react.dev/learn/adding-interactivity][React event handlers]]
        * [[https://clojure.org/guides/async_walkthrough][core.async Walkthrough]]
        * [[https://stackoverflow.com/questions/56028913/usememo-vs-useeffect-usestate][useMemo vs. useEffect + useState]]
        * https://www.freecodecamp.org/news/how-to-work-with-usememo-in-react/

   C) some people suggest to use Axios directly from Clojurescript.
 - [X] Display nice formatted results
   - https://developer.atlassian.com/cloud/jira/platform/rest/v3/api-group-issue-type-properties/#api-rest-api-3-issuetype-issuetypeid-properties-get
 - [X] Do a call via function
 - [X] Connect results it via ~use-effect~ or somehow else? Read docs and do!
 - [X] Fine tune the display results
 - [X] Show estimates column
 - [X] Limit to a project via settings
 - [X] Add button to ticket details & estimation process
 - [X] Logout button
 - [X] Switch to voting screen
 - [X] Async python function with results caching on FastAPI / (memoize | Redis)
 - [X] avoid 2 staged query/re-render for search term 'payment`
   - [X] solution: implement same structure (as for saving comment) for searching after delay only! user need to stop typing to see results!
 - [X] indicate that query is running, also which query is running! with a color and sticker! and some effect!
 - [ ] (low pri) May be make a list of previous queries to be able to re-run them
   - [ ] use python pickle!
 - [ ] (low pri) Provide a list of pre-defined queiries on app start or save them to a file and then restore

** DONE add jql: search support
   CLOSED: [2024-09-15 Sun 15:30]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2024-09-15 Sun 15:30]
   - State "TODO"       from              [2024-09-08 Sun 12:55]
   :END:
** DONE fix design=placement for estimate / results boxes
   CLOSED: [2024-09-20 Fri 08:00]
   :LOGBOOK:
   CLOCK: [2024-09-20 Fri 07:38]--[2024-09-20 Fri 07:58] =>  0:20
   - State "DONE"       from "TODO"       [2024-09-20 Fri 08:00]
   - State "TODO"       from              [2024-09-20 Fri 07:40]
   :END:
