static/docs/README.html
<div id="outline-container-org6581361" class="outline-4">
<h4 id="org6581361"><span class="done DONE">DONE</span> use FastAPI! use Google auth &amp; ready Jira integration I have!</h4>
<div class="outline-text-4" id="text-org6581361">
<ul class="org-ul">
<li><a href="https://google-auth.readthedocs.io/en/master/">https://google-auth.readthedocs.io/en/master/</a></li>
<li><a href="https://github.com/hanchon-live/tutorial-fastapi-oauth">https://github.com/hanchon-live/tutorial-fastapi-oauth</a></li>
<li><a href="https://blog.hanchon.live/guides/google-login-with-fastapi/">https://blog.hanchon.live/guides/google-login-with-fastapi/</a> (following)</li>
<li><a href="https://docs.authlib.org/en/latest/client/starlette.html">https://docs.authlib.org/en/latest/client/starlette.html</a> (works)</li>
</ul>
</div>
</div>
<div id="outline-container-org05baac1" class="outline-4">
<h4 id="org05baac1"><span class="done DONE">DONE</span> Use websocket for fast communication!</h4>
<div class="outline-text-4" id="text-org05baac1">
<ul class="org-ul">
<li>FastAPI provides support:</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf0d03a7" class="outline-3">
<h3 id="orgf0d03a7"><span class="done REJECTED">REJECTED</span> UI Plan on functional implementation <code>[0/6]</code></h3>
<div class="outline-text-3" id="text-orgf0d03a7">
<ul class="org-ul">
<li>SPA - one screen on UIx</li>
<li class="off"><code>[&#xa0;]</code> List logged in users</li>
<li class="off"><code>[&#xa0;]</code> Set color for facilitator?
<ul class="org-ul">
<li>how to agree who is facilitator? may be anyone can? probably yes, but then warn on top who started it</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Countdown timer (configuration for length) starts</li>
<li class="off"><code>[&#xa0;]</code> List of SPs (configuration)</li>
<li class="off"><code>[&#xa0;]</code> Strike for users who voted</li>
<li class="off"><code>[&#xa0;]</code> Reveal cards with some visual effect</li>
</ul>
</div>
</div>
<div id="outline-container-orga7672fc" class="outline-3">
<h3 id="orga7672fc"><span class="done DONE">DONE</span> Bootstrap: FastAPI + UIx^2 in one folder &amp; dev/prod start/deploy/+sentry/+logging</h3>
<div class="outline-text-3" id="text-orga7672fc">
<ul class="org-ul">
<li class="on"><code>[X]</code> Install fastapi via poetry</li>
<li class="on"><code>[X]</code> Bootstrap UIX^2 project</li>
<li class="on"><code>[X]</code> Add/commit to git</li>
<li class="off"><code>[&#xa0;]</code> Publish on github</li>
</ul>
</div>
</div>
<div id="outline-container-org597f9db" class="outline-3">
<h3 id="org597f9db"><span class="done DONE">DONE</span> Google auth &amp; JWT token (or session cookie)</h3>
<div class="outline-text-3" id="text-org597f9db">
</div>
</div>
<div id="outline-container-org2f78966" class="outline-3">
<h3 id="org2f78966"><span class="done DONE">DONE</span> add running via bb.edn</h3>
<div class="outline-text-3" id="text-org2f78966">
<ul class="org-ul">
<li>Finish watching <a href="https://www.youtube.com/watch?v=u5ECoR7KT1Y">Babashka tasks (by Michiel Borkent)</a> from <i>The London Clojurians are happy to present 3 years ago</i></li>
</ul>
</div>
</div>
<div id="outline-container-org767ab4d" class="outline-3">
<h3 id="org767ab4d"><span class="done DONE">DONE</span> fix burger menu for mobile</h3>
<div class="outline-text-3" id="text-org767ab4d">
</div>
</div>
<div id="outline-container-orgacebabe" class="outline-3">
<h3 id="orgacebabe"><span class="done DONE">DONE</span> use iframe for docs part</h3>
<div class="outline-text-3" id="text-orgacebabe">
</div>
</div>
<div id="outline-container-org2a65066" class="outline-3">
<h3 id="org2a65066"><span class="todo TODO">TODO</span> Search for ticket (Estimate ticket screen) <code>[14/16]</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="verb">verb</span></span></h3>
<div class="outline-text-3" id="text-org2a65066">
<ul class="org-ul">
<li class="on"><code>[X]</code> Make a stub function on FastAPI side for now.</li>
<li class="on"><code>[X]</code> Select library to make HTTP calls.
<ol class="org-ol">
<li>Trying <a href="https://github.com/lambdaisland/fetch">https://github.com/lambdaisland/fetch</a></li>
<li class="on"><code>[X]</code> <p>
(this is an alternative to try) <a href="https://github.com/r0man/cljs-http?tab=readme-ov-file">https://github.com/r0man/cljs-http?tab=readme-ov-file</a>
</p>
<div class="org-src-container">
<pre class="src src-verb"><span style="color: #0000b0; font-weight: bold;">GET</span> https://api.github.com/users?since=135
<span style="color: #0000b0;">User-agent:</span> emacs
</pre>
</div>
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2024-08-27 Tue 09:25] </span></span> I am having difficulties to connect async nature of core-async channels (same as promises?)
to the actual useEffect or anything. Reading&#x2026;
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/71174509/proper-async-await-syntax-for-fetching-data-using-useeffect-hook-in-react">async in useEffect</a></li>
<li><a href="https://pitch-io.github.io/uix/docs/hooks.html">Uix on hooks</a></li>
<li><a href="https://react.dev/learn/adding-interactivity">React event handlers</a></li>
<li><a href="https://clojure.org/guides/async_walkthrough">core.async Walkthrough</a></li>
<li><a href="https://stackoverflow.com/questions/56028913/usememo-vs-useeffect-usestate">useMemo vs. useEffect + useState</a></li>
<li><a href="https://www.freecodecamp.org/news/how-to-work-with-usememo-in-react/">https://www.freecodecamp.org/news/how-to-work-with-usememo-in-react/</a></li>
</ul></li>
</ul></li>

<li>some people suggest to use Axios directly from Clojurescript.</li>
</ol></li>
<li class="on"><code>[X]</code> Display nice formatted results
<ul class="org-ul">
<li><a href="https://developer.atlassian.com/cloud/jira/platform/rest/v3/api-group-issue-type-properties/#api-rest-api-3-issuetype-issuetypeid-properties-get">https://developer.atlassian.com/cloud/jira/platform/rest/v3/api-group-issue-type-properties/#api-rest-api-3-issuetype-issuetypeid-properties-get</a></li>
</ul></li>
<li class="on"><code>[X]</code> Do a call via function</li>
<li class="on"><code>[X]</code> Connect results it via <code>use-effect</code> or somehow else? Read docs and do!</li>
<li class="on"><code>[X]</code> Fine tune the display results</li>
<li class="on"><code>[X]</code> Show estimates column</li>
<li class="on"><code>[X]</code> Limit to a project via settings</li>
<li class="on"><code>[X]</code> Add button to ticket details &amp; estimation process</li>
<li class="on"><code>[X]</code> Logout button</li>
<li class="on"><code>[X]</code> Switch to voting screen</li>
<li class="on"><code>[X]</code> Async python function with results caching on FastAPI / (memoize | Redis)</li>
<li class="on"><code>[X]</code> avoid 2 staged query/re-render for search term 'payment`
<ul class="org-ul">
<li class="on"><code>[X]</code> solution: implement same structure (as for saving comment) for searching after delay only! user need to stop typing to see results!</li>
</ul></li>
<li class="on"><code>[X]</code> indicate that query is running, also which query is running! with a color and sticker! and some effect!</li>
<li class="off"><code>[&#xa0;]</code> (low pri) May be make a list of previous queries to be able to re-run them
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> use python pickle!</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> (low pri) Provide a list of pre-defined queiries on app start or save them to a file and then restore</li>
</ul>
</div>
</div>
<div id="outline-container-org2262466" class="outline-3">
<h3 id="org2262466"><span class="done DONE">DONE</span> add jql: search support</h3>
<div class="outline-text-3" id="text-org2262466">
</div>
</div>
<div id="outline-container-org94d83cc" class="outline-3">
<h3 id="org94d83cc"><span class="done DONE">DONE</span> fix design=placement for estimate / results boxes</h3>
<div class="outline-text-3" id="text-org94d83cc">
</div>
</div>
