README.org
** DONE logging
   CLOSED: [2024-09-17 Tue 07:30]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2024-09-17 Tue 07:30]
   - State "TODO"       from              [2024-09-16 Mon 09:55]
   :END:
 - [X] Log display as is-info
 - [X] Or display N lines with timestamp and history scroll
 - [X] disappear after 1-3 seconds with fade out effect!
   - https://ericnormand.me/guide/timeout-effect-in-re-frame
   - https://stackoverflow.com/questions/76258055/how-to-add-fade-in-animation-to-a-component-when-it-is-loaded-in-react
 - [X] delete individual message
 - +[ ] display not more then 3 messages+
** DONE Voting screen [15/15] [100%]
   CLOSED: [2024-09-22 Sun 13:10]
   :LOGBOOK:
   - State "DONE"       from "WORKING"    [2024-09-22 Sun 13:10]
   CLOCK: [2024-09-22 Sun 07:30]--[2024-09-22 Sun 08:57] =>  1:27
   CLOCK: [2024-09-20 Fri 07:58]--[2024-09-20 Fri 08:39] =>  0:41
   CLOCK: [2024-09-20 Fri 07:00]--[2024-09-20 Fri 07:38] =>  0:38
   CLOCK: [2024-09-19 Thu 06:00]--[2024-09-19 Thu 08:00] =>  2:00
   CLOCK: [2024-09-08 Sun 16:35]--[2024-09-08 Sun 18:01] =>  1:26
   CLOCK: [2024-09-08 Sun 15:00]--[2024-09-08 Sun 15:40] =>  0:40
   CLOCK: [2024-09-08 Sun 12:27]--[2024-09-08 Sun 13:00] =>  0:33
   CLOCK: [2024-09-08 Sun 10:30]--[2024-09-08 Sun 11:04] =>  0:34
   CLOCK: [2024-09-07 Sat 08:42]--[2024-09-07 Sat 13:00] =>  4:18
   CLOCK: [2024-09-06 Fri 07:31]--[2024-09-06 Fri 08:24] =>  0:53
   - State "WORKING"    from "TODO"       [2024-09-05 Thu 09:25]
   CLOCK: [2024-09-05 Thu 07:30]--[2024-09-05 Thu 09:27] =>  1:57
   - State "TODO"       from              [2024-08-28 Wed 23:25]
   :END:

 - [X] Menu is-active
 - [X] Prepare FastAPI endpoint
 - [X] Cache ticket data
 - [X] Display data on screen
   - [2024-09-06 Fri 09:25] data is displayed but ~markdown~ formatting is required...
   - [X] format markdown (on backend?)
   - [X] format URLs via custom fn
   - [X] +(maybe) format images as external URLs via custom fn?+
     - /got Permission denied!/
 - [X] Add 'vote' layout block
 - [X] Set voted ticket & bg color for button
 - [X] Send vote data to server
   - [X] add backend endpoint
     - [X] store data in dict. [[https://stackoverflow.com/questions/19201290/how-to-save-a-dictionary-to-a-file][use pickle?]]
   - [X] add fx handler event
   - +[ ] we also need to send POST on estimation start!+ we already have info
   - [X] send data only if value has changed!
 - +[ ] Countdown timer for voting (configure the length via .env)+ no need, can be replaced by 'finish'
 - [X] Indication who has started voting.
 - [X] Indication of people which finished voting - +list.+ log
 - [X] Reveal results
 - [X] Fix red/yellow colors for big estimates, add for hours too
 - [X] Fix estimate restart
 - [X] Rewrite widget to split voting into 3 categories: Frontend, Backend and QA
   - [X] Splitting into categories in voting box & backend
   - [X] Splitting into categories in results box
   - [X] Make it possible to choose: SP or Hours
 - [X] Send results to Jira by adding formatted comment to ticket like (in hours):
   #+begin_example
   Back: ...
   Front: ...
   QA: ...
   #+end_example
 - [X] How to reset use-state data when voting restarts?

** DONE check logged in state (when in ~/app~) and other statuses (because currenly it allows to see ~/app/~ [1/2]
   CLOSED: [2024-09-17 Tue 20:50]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2024-09-17 Tue 20:50]
   - State "TODO"       from "REVIEW"     [2024-09-15 Sun 08:45]
   - State "REVIEW"     from              [2024-09-15 Sun 08:45]
   :END:

 - [X] make 'sync' / 'status' query.

** DONE Websocket coordination [9/10]
   CLOSED: [2024-09-22 Sun 09:50]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2024-09-22 Sun 09:50]
   CLOCK: [2024-09-15 Sun 10:05]--[2024-09-15 Sun 15:08] =>  5:03
   CLOCK: [2024-09-14 Sat 07:46]--[2024-09-14 Sat 15:48] =>  8:02
   CLOCK: [2024-09-12 Thu 07:54]--[2024-09-12 Thu 09:27] =>  1:33
   CLOCK: [2024-09-11 Wed 07:00]--[2024-09-11 Wed 08:00] =>  1:00
   CLOCK: [2024-09-10 Tue 20:52]--[2024-09-11 Wed 07:56] => 11:04
   CLOCK: [2024-09-09 Mon 22:00]--[2024-09-09 Mon 22:46] =>  0:46
   CLOCK: [2024-09-09 Mon 07:35]--[2024-09-09 Mon 08:02] =>  0:27
   - State "TODO"       from              [2024-08-28 Wed 23:25]
   :END:
 
- [X] Add WS handler on backend, check it works with sample HTML code
- [X] pub/sub pattern on FastAPI backend:
  - https://pypi.org/project/fastapi-websocket-pubsub/
  - https://gist.github.com/appeltel/fd3ddeeed6c330c7208502462639d2c9
  - https://github.com/6ixOnline/fastapi-pubsub
  - tired from non-working examples. switching to a well known path with 
    aioredis https://aioredis.readthedocs.io/en/latest/#installation
  - https://gist.github.com/charsyam/1efc7f38860225c63b05379fffe73256
  - https://medium.com/@nandagopal05/scaling-websockets-with-pub-sub-using-python-redis-fastapi-b16392ffe291
  - [X] https://github.com/Thierry46/pubsub (Looks good, embedding it!) [2024-09-11 Wed 07:55]
  - https://github.com/fastapi/fastapi/issues/258
- [X] Add WS support on cljs side
  - https://github.com/weavejester/haslett
  - https://github.com/RutledgePaulV/websocket-fx?tab=readme-ov-file
  - https://github.com/ftravers/reframe-websocket
  - https://heykieran.github.io/post/using-sse-and-websockets/
  - https://dev.to/bitecode/turn-sync-function-to-async-python-tips-58nn
- [2024-09-14 Sat 15:35] got tired by implementing websocket coordination but it finally works
- [ ] auto reconnect web socket?!!
- [X] send current screen info after auto reconnect/connect!
- [X] +'sync' button to reconnect websocket (red/green/auto reconnect)+ can use Home!
- [X] Synhronize current screen
  - add 'app-state' endpoint - we will check this after login/on app load because
    async user can do anything async
  - react to ws messages online - e.g. commands:
    - +[ ] Goto screen <name>+
    - [X] Vote for ticket <jira id>
    - [X] Voting finished (works for manual finish too)
    - [X] User logged in: (<username>)
    - [X] Online members (16): A, B, C
- [X] Display voting results when 'voting finished' received
- [X] Listen & display online members (log)
- [X] websocket for logging updates!
