static/docs/README.html
<div id="outline-container-org0b2c3ca" class="outline-3">
<h3 id="org0b2c3ca"><span class="done DONE">DONE</span> logging</h3>
<div class="outline-text-3" id="text-org0b2c3ca">
<ul class="org-ul">
<li class="on"><code>[X]</code> Log display as is-info</li>
<li class="on"><code>[X]</code> Or display N lines with timestamp and history scroll</li>
<li class="on"><code>[X]</code> disappear after 1-3 seconds with fade out effect!
<ul class="org-ul">
<li><a href="https://ericnormand.me/guide/timeout-effect-in-re-frame">https://ericnormand.me/guide/timeout-effect-in-re-frame</a></li>
<li><a href="https://stackoverflow.com/questions/76258055/how-to-add-fade-in-animation-to-a-component-when-it-is-loaded-in-react">https://stackoverflow.com/questions/76258055/how-to-add-fade-in-animation-to-a-component-when-it-is-loaded-in-react</a></li>
</ul></li>
<li class="on"><code>[X]</code> delete individual message</li>
<li><del>[ ] display not more then 3 messages</del></li>
</ul>
</div>
</div>
<div id="outline-container-org42ffee8" class="outline-3">
<h3 id="org42ffee8"><span class="done DONE">DONE</span> Voting screen <code>[15/15]</code> <code>[100%]</code></h3>
<div class="outline-text-3" id="text-org42ffee8">
<ul class="org-ul">
<li class="on"><code>[X]</code> Menu is-active</li>
<li class="on"><code>[X]</code> Prepare FastAPI endpoint</li>
<li class="on"><code>[X]</code> Cache ticket data</li>
<li class="on"><code>[X]</code> Display data on screen
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2024-09-06 Fri 09:25] </span></span> data is displayed but <code>markdown</code> formatting is required&#x2026;</li>
<li class="on"><code>[X]</code> format markdown (on backend?)</li>
<li class="on"><code>[X]</code> format URLs via custom fn</li>
<li class="on"><code>[X]</code> <del>(maybe) format images as external URLs via custom fn?</del>
<ul class="org-ul">
<li><i>got Permission denied!</i></li>
</ul></li>
</ul></li>
<li class="on"><code>[X]</code> Add 'vote' layout block</li>
<li class="on"><code>[X]</code> Set voted ticket &amp; bg color for button</li>
<li class="on"><code>[X]</code> Send vote data to server
<ul class="org-ul">
<li class="on"><code>[X]</code> add backend endpoint
<ul class="org-ul">
<li class="on"><code>[X]</code> store data in dict. <a href="https://stackoverflow.com/questions/19201290/how-to-save-a-dictionary-to-a-file">use pickle?</a></li>
</ul></li>
<li class="on"><code>[X]</code> add fx handler event</li>
<li><del>[ ] we also need to send POST on estimation start!</del> we already have info</li>
<li class="on"><code>[X]</code> send data only if value has changed!</li>
</ul></li>
<li><del>[ ] Countdown timer for voting (configure the length via .env)</del> no need, can be replaced by 'finish'</li>
<li class="on"><code>[X]</code> Indication who has started voting.</li>
<li class="on"><code>[X]</code> Indication of people which finished voting - <del>list.</del> log</li>
<li class="on"><code>[X]</code> Reveal results</li>
<li class="on"><code>[X]</code> Fix red/yellow colors for big estimates, add for hours too</li>
<li class="on"><code>[X]</code> Fix estimate restart</li>
<li class="on"><code>[X]</code> Rewrite widget to split voting into 3 categories: Frontend, Backend and QA
<ul class="org-ul">
<li class="on"><code>[X]</code> Splitting into categories in voting box &amp; backend</li>
<li class="on"><code>[X]</code> Splitting into categories in results box</li>
<li class="on"><code>[X]</code> Make it possible to choose: SP or Hours</li>
</ul></li>
<li class="on"><code>[X]</code> <p>
Send results to Jira by adding formatted comment to ticket like (in hours):
</p>
<pre class="example" id="org71162b9">
Back: ...
Front: ...
QA: ...
</pre></li>
<li class="on"><code>[X]</code> How to reset use-state data when voting restarts?</li>
</ul>
</div>
</div>
<div id="outline-container-org2afde18" class="outline-3">
<h3 id="org2afde18"><span class="done DONE">DONE</span> check logged in state (when in <code>/app</code>) and other statuses (because currenly it allows to see <code>/app/</code> <code>[1/2]</code></h3>
<div class="outline-text-3" id="text-org2afde18">
<ul class="org-ul">
<li class="on"><code>[X]</code> make 'sync' / 'status' query.</li>
</ul>
</div>
</div>
<div id="outline-container-org55cbf3e" class="outline-3">
<h3 id="org55cbf3e"><span class="done DONE">DONE</span> Websocket coordination <code>[9/10]</code></h3>
<div class="outline-text-3" id="text-org55cbf3e">
<ul class="org-ul">
<li class="on"><code>[X]</code> Add WS handler on backend, check it works with sample HTML code</li>
<li class="on"><code>[X]</code> pub/sub pattern on FastAPI backend:
<ul class="org-ul">
<li><a href="https://pypi.org/project/fastapi-websocket-pubsub/">https://pypi.org/project/fastapi-websocket-pubsub/</a></li>
<li><a href="https://gist.github.com/appeltel/fd3ddeeed6c330c7208502462639d2c9">https://gist.github.com/appeltel/fd3ddeeed6c330c7208502462639d2c9</a></li>
<li><a href="https://github.com/6ixOnline/fastapi-pubsub">https://github.com/6ixOnline/fastapi-pubsub</a></li>
<li>tired from non-working examples. switching to a well known path with 
aioredis <a href="https://aioredis.readthedocs.io/en/latest/#installation">https://aioredis.readthedocs.io/en/latest/#installation</a></li>
<li><a href="https://gist.github.com/charsyam/1efc7f38860225c63b05379fffe73256">https://gist.github.com/charsyam/1efc7f38860225c63b05379fffe73256</a></li>
<li><a href="https://medium.com/@nandagopal05/scaling-websockets-with-pub-sub-using-python-redis-fastapi-b16392ffe291">https://medium.com/@nandagopal05/scaling-websockets-with-pub-sub-using-python-redis-fastapi-b16392ffe291</a></li>
<li class="on"><code>[X]</code> <a href="https://github.com/Thierry46/pubsub">https://github.com/Thierry46/pubsub</a> (Looks good, embedding it!) <span class="timestamp-wrapper"><span class="timestamp">[2024-09-11 Wed 07:55]</span></span></li>
<li><a href="https://github.com/fastapi/fastapi/issues/258">https://github.com/fastapi/fastapi/issues/258</a></li>
</ul></li>
<li class="on"><code>[X]</code> Add WS support on cljs side
<ul class="org-ul">
<li><a href="https://github.com/weavejester/haslett">https://github.com/weavejester/haslett</a></li>
<li><a href="https://github.com/RutledgePaulV/websocket-fx?tab=readme-ov-file">https://github.com/RutledgePaulV/websocket-fx?tab=readme-ov-file</a></li>
<li><a href="https://github.com/ftravers/reframe-websocket">https://github.com/ftravers/reframe-websocket</a></li>
<li><a href="https://heykieran.github.io/post/using-sse-and-websockets/">https://heykieran.github.io/post/using-sse-and-websockets/</a></li>
<li><a href="https://dev.to/bitecode/turn-sync-function-to-async-python-tips-58nn">https://dev.to/bitecode/turn-sync-function-to-async-python-tips-58nn</a></li>
</ul></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2024-09-14 Sat 15:35] </span></span> got tired by implementing websocket coordination but it finally works</li>
<li class="off"><code>[&#xa0;]</code> auto reconnect web socket?!!</li>
<li class="on"><code>[X]</code> send current screen info after auto reconnect/connect!</li>
<li class="on"><code>[X]</code> <del>'sync' button to reconnect websocket (red/green/auto reconnect)</del> can use Home!</li>
<li class="on"><code>[X]</code> Synhronize current screen
<ul class="org-ul">
<li>add 'app-state' endpoint - we will check this after login/on app load because
async user can do anything async</li>
<li>react to ws messages online - e.g. commands:
<ul class="org-ul">
<li><del>[ ] Goto screen &lt;name&gt;</del></li>
<li class="on"><code>[X]</code> Vote for ticket &lt;jira id&gt;</li>
<li class="on"><code>[X]</code> Voting finished (works for manual finish too)</li>
<li class="on"><code>[X]</code> User logged in: (&lt;username&gt;)</li>
<li class="on"><code>[X]</code> Online members (16): A, B, C</li>
</ul></li>
</ul></li>
<li class="on"><code>[X]</code> Display voting results when 'voting finished' received</li>
<li class="on"><code>[X]</code> Listen &amp; display online members (log)</li>
<li class="on"><code>[X]</code> websocket for logging updates!</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: avkoval (ok)</p>
<p class="date">Created: 2024-09-22 Sun 14:13</p>
</div>
</body>
</html>
